zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SECTRL.h
/*
** ###################################################################
**     Processors:          LPC5534JBD100
**                          LPC5534JBD64
**                          LPC5534JHI48
**                          LPC5536JBD100
**                          LPC5536JBD64
**                          LPC5536JHI48
**                          LPC55S36JBD100
**                          LPC55S36JHI48
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260515
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SECTRL
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-04-12)
**         Initial version based on RM DraftF
**     - rev. 1.1 (2021-08-04)
**         Initial version based on RM DraftG
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SECTRL.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SECTRL
 *
 * CMSIS Peripheral Access Layer for SECTRL
 */

#if !defined(PERI_SECTRL_H_)
#define PERI_SECTRL_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC5534JBD100) || defined(CPU_LPC5534JBD64) || defined(CPU_LPC5534JHI48))
#include "LPC5534_COMMON.h"
#elif (defined(CPU_LPC5536JBD100) || defined(CPU_LPC5536JBD64) || defined(CPU_LPC5536JHI48))
#include "LPC5536_COMMON.h"
#elif (defined(CPU_LPC55S36JBD100) || defined(CPU_LPC55S36JHI48))
#include "LPC55S36_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SECTRL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECTRL_Peripheral_Access_Layer SECTRL Peripheral Access Layer
 * @{
 */

/** SECTRL - Size of Registers Arrays */
#define SECTRL_ROM_MEM_RULE_COUNT                 4u
#define SECTRL_FLEXSPI0_REGION0_MEM_RULE_COUNT    4u
#define SECTRL_FLEXSPI0_REGION1_4_MEM_RULE_COUNT  4u
#define SECTRL_SEC_VIO_ADDRN_COUNT                32u
#define SECTRL_SEC_VIO_MISC_INFON_COUNT           32u
#define SECTRL_SEC_GPIO_MASKN_COUNT               3u
#define SECTRL_CM33_LOCK_REGN_COUNT               3u

/** SECTRL - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t FLASH_MEM_RULE;                    /**< Flash Memory Rule, offset: 0x10 */
       uint8_t RESERVED_1[12];
  __IO uint32_t ROM_MEM_RULE[SECTRL_ROM_MEM_RULE_COUNT]; /**< ROM Memory Rule, array offset: 0x20, array step: 0x4 */
       uint8_t RESERVED_2[16];
  __IO uint32_t RAMX_MEM_RULE0;                    /**< RAMX Memory Rule 0, offset: 0x40 */
       uint8_t RESERVED_3[28];
  __IO uint32_t FLEXSPI0_REGION0_MEM_RULE[SECTRL_FLEXSPI0_REGION0_MEM_RULE_COUNT]; /**< FLEXSPI0 Region 0 Memory Rule, array offset: 0x60, array step: 0x4 */
  struct {                                         /* offset: 0x70, array step: 0x10 */
    __IO uint32_t FLEXSPI0_REGION_MEM_RULE0;         /**< FLEXSPI0 Region 1 Memory Rule 0..FLEXSPI0 Region 4 Memory Rule 0, array offset: 0x70, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } FLEXSPI0_REGION1_4_MEM_RULE[SECTRL_FLEXSPI0_REGION1_4_MEM_RULE_COUNT];
       uint8_t RESERVED_4[16];
  __IO uint32_t RAM00_MEM_RULE0;                   /**< SRAM0 Partition 0 Memory Rule, offset: 0xC0 */
       uint8_t RESERVED_5[28];
  __IO uint32_t RAM10_MEM_RULE0;                   /**< SRAM1 Partition 0 Memory Rule, offset: 0xE0 */
       uint8_t RESERVED_6[28];
  __IO uint32_t RAM20_MEM_RULE0;                   /**< SRAM2 Partition 0 Memory Rule, offset: 0x100 */
       uint8_t RESERVED_7[28];
  __IO uint32_t RAM30_MEM_RULE0;                   /**< SRAM Partition 0 Memory Rule, offset: 0x120 */
       uint8_t RESERVED_8[28];
  __IO uint32_t RAM40_MEM_RULE0;                   /**< SRAM4 Partition 0 Memory Rule, offset: 0x140 */
       uint8_t RESERVED_9[28];
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE0;   /**< APB Bridge Group 0 Memory Rule 0, offset: 0x160 */
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE1;   /**< APB Bridge Group 0 Memory Rule 1, offset: 0x164 */
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE2;   /**< APB Bridge Group 0 Rule 2, offset: 0x168 */
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE3;   /**< APB Bridge Group 0 Memory Rule 3, offset: 0x16C */
  __IO uint32_t APB_PERIPHERAL_GROUP1_MEM_RULE0;   /**< APB Bridge Group 1 Memory Rule 0, offset: 0x170 */
  __IO uint32_t APB_PERIPHERAL_GROUP1_MEM_RULE1;   /**< APB Bridge Group 1 Memory Rule 1, offset: 0x174 */
  __IO uint32_t APB_PERIPHERAL_GROUP1_MEM_RULE2;   /**< APB Bridge Group 1 Memory Rule 2, offset: 0x178 */
  __IO uint32_t APB_PERIPHERAL_GROUP1_MEM_RULE3;   /**< APB Bridge Group 1 Memory Rule 3, offset: 0x17C */
       uint8_t RESERVED_10[16];
  __IO uint32_t AHB_PERIPHERAL0_SLAVE_PORT_P9_SLAVE_RULE0; /**< AHB Peripheral 0 Slave Port9 Rule 0, offset: 0x190 */
  __IO uint32_t AHB_PERIPHERAL0_SLAVE_PORT_P9_SLAVE_RULE1; /**< AHB Peripheral 0 Slave Port 9 Rule 1, offset: 0x194 */
       uint8_t RESERVED_11[8];
  __IO uint32_t AHB_PERIPHERAL1_SLAVE_PORT_P10_SLAVE_0; /**< AHB Peripheral 1 Slave Port 10 Slave Rule 0, offset: 0x1A0 */
       uint8_t RESERVED_12[12];
  __IO uint32_t AHB_PERIPHERAL2_SLAVE_PORT_P11_SLAVE_RULE0; /**< AHB Peripheral 2 Slave Port 11 Slave Rule 0, offset: 0x1B0 */
       uint8_t RESERVED_13[12];
  __IO uint32_t AHB_SECURE_CTRL_PERIPHERAL_MEM_RULE0; /**< AHB Secure Control Peripheral Memory Rule 0, offset: 0x1C0 */
       uint8_t RESERVED_14[28];
  __IO uint32_t AIPS_BRIDGE_GROUP0_RULE0;          /**< AIPS Bridge Group 0 Rule 0, offset: 0x1E0 */
  __IO uint32_t AIPS_BRIDGE_GROUP0_RULE1;          /**< AIPS Bridge Group 0 Rule 1, offset: 0x1E4 */
       uint8_t RESERVED_15[24];
  __IO uint32_t AIPS_BRIDGE_GROUP1_RULE0;          /**< AIPS Bridge Group 1 Rule 0, offset: 0x200 */
  __IO uint32_t AIPS_BRIDGE_GROUP1_RULE1;          /**< AIPS Bridge Group 1 Rule 1, offset: 0x204 */
       uint8_t RESERVED_16[3064];
  __I  uint32_t SEC_VIO_ADDR[SECTRL_SEC_VIO_ADDRN_COUNT]; /**< Security Violation Address, array offset: 0xE00, array step: 0x4 */
  __I  uint32_t SEC_VIO_MISC_INFO[SECTRL_SEC_VIO_MISC_INFON_COUNT]; /**< Security Violation Miscellaneous Information at Address, array offset: 0xE80, array step: 0x4 */
  __IO uint32_t SEC_VIO_INFO_VALID;                /**< Security Violation Info Validity for Address, offset: 0xF00 */
       uint8_t RESERVED_17[124];
  __IO uint32_t SEC_GPIO_MASK[SECTRL_SEC_GPIO_MASKN_COUNT]; /**< GPIO Mask for Port 0..GPIO Mask for Port 2, array offset: 0xF80, array step: 0x4 */
  __IO uint32_t SEC_GPIO_MASK3;                    /**< GPIO Mask for Port 3, offset: 0xF8C */
       uint8_t RESERVED_18[44];
  __IO uint32_t SEC_GP_REG_LOCK;                   /**< Secure Mask Lock, offset: 0xFBC */
       uint8_t RESERVED_19[16];
  __IO uint32_t MASTER_SEC_LEVEL;                  /**< Master Secure Level, offset: 0xFD0 */
  __IO uint32_t MASTER_SEC_ANTI_POL_REG;           /**< Master Secure Level, offset: 0xFD4 */
       uint8_t RESERVED_20[20];
  __IO uint32_t CM33_LOCK_REG[SECTRL_CM33_LOCK_REGN_COUNT]; /**< Miscellaneous CPU0 Control Signals, array offset: 0xFEC, array step: 0x4 */
  __IO uint32_t MISC_CTRL_DP_REG;                  /**< Secure Control Duplicate, offset: 0xFF8 */
  __IO uint32_t MISC_CTRL_REG;                     /**< Secure Control, offset: 0xFFC */
} SECTRL_Type;

/* ----------------------------------------------------------------------------
   -- SECTRL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SECTRL_Register_Masks SECTRL Register Masks
 * @{
 */

/*! @name FLASH_MEM_RULE - Flash Memory Rule */
/*! @{ */

#define SECTRL_FLASH_MEM_RULE_RULE0_MASK         (0x3U)
#define SECTRL_FLASH_MEM_RULE_RULE0_SHIFT        (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_FLASH_MEM_RULE_RULE0(x)           (((uint32_t)(((uint32_t)(x)) << SECTRL_FLASH_MEM_RULE_RULE0_SHIFT)) & SECTRL_FLASH_MEM_RULE_RULE0_MASK)

