zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SECTRL.h
#define SECTRL_RAM00_MEM_RULE0_RULE1_MASK        (0x30U)
#define SECTRL_RAM00_MEM_RULE0_RULE1_SHIFT       (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM00_MEM_RULE0_RULE1(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM00_MEM_RULE0_RULE1_SHIFT)) & SECTRL_RAM00_MEM_RULE0_RULE1_MASK)

#define SECTRL_RAM00_MEM_RULE0_RULE2_MASK        (0x300U)
#define SECTRL_RAM00_MEM_RULE0_RULE2_SHIFT       (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM00_MEM_RULE0_RULE2(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM00_MEM_RULE0_RULE2_SHIFT)) & SECTRL_RAM00_MEM_RULE0_RULE2_MASK)

#define SECTRL_RAM00_MEM_RULE0_RULE3_MASK        (0x3000U)
#define SECTRL_RAM00_MEM_RULE0_RULE3_SHIFT       (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM00_MEM_RULE0_RULE3(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM00_MEM_RULE0_RULE3_SHIFT)) & SECTRL_RAM00_MEM_RULE0_RULE3_MASK)
/*! @} */

/*! @name RAM10_MEM_RULE0 - SRAM1 Partition 0 Memory Rule */
/*! @{ */

#define SECTRL_RAM10_MEM_RULE0_RULE0_MASK        (0x3U)
#define SECTRL_RAM10_MEM_RULE0_RULE0_SHIFT       (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM10_MEM_RULE0_RULE0(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM10_MEM_RULE0_RULE0_SHIFT)) & SECTRL_RAM10_MEM_RULE0_RULE0_MASK)

#define SECTRL_RAM10_MEM_RULE0_RULE1_MASK        (0x30U)
#define SECTRL_RAM10_MEM_RULE0_RULE1_SHIFT       (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM10_MEM_RULE0_RULE1(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM10_MEM_RULE0_RULE1_SHIFT)) & SECTRL_RAM10_MEM_RULE0_RULE1_MASK)

#define SECTRL_RAM10_MEM_RULE0_RULE2_MASK        (0x300U)
#define SECTRL_RAM10_MEM_RULE0_RULE2_SHIFT       (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM10_MEM_RULE0_RULE2(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM10_MEM_RULE0_RULE2_SHIFT)) & SECTRL_RAM10_MEM_RULE0_RULE2_MASK)

#define SECTRL_RAM10_MEM_RULE0_RULE3_MASK        (0x3000U)
#define SECTRL_RAM10_MEM_RULE0_RULE3_SHIFT       (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM10_MEM_RULE0_RULE3(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM10_MEM_RULE0_RULE3_SHIFT)) & SECTRL_RAM10_MEM_RULE0_RULE3_MASK)
/*! @} */

/*! @name RAM20_MEM_RULE0 - SRAM2 Partition 0 Memory Rule */
/*! @{ */

#define SECTRL_RAM20_MEM_RULE0_RULE0_MASK        (0x3U)
#define SECTRL_RAM20_MEM_RULE0_RULE0_SHIFT       (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM20_MEM_RULE0_RULE0(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM20_MEM_RULE0_RULE0_SHIFT)) & SECTRL_RAM20_MEM_RULE0_RULE0_MASK)

#define SECTRL_RAM20_MEM_RULE0_RULE1_MASK        (0x30U)
#define SECTRL_RAM20_MEM_RULE0_RULE1_SHIFT       (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM20_MEM_RULE0_RULE1(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM20_MEM_RULE0_RULE1_SHIFT)) & SECTRL_RAM20_MEM_RULE0_RULE1_MASK)

#define SECTRL_RAM20_MEM_RULE0_RULE2_MASK        (0x300U)
#define SECTRL_RAM20_MEM_RULE0_RULE2_SHIFT       (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM20_MEM_RULE0_RULE2(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM20_MEM_RULE0_RULE2_SHIFT)) & SECTRL_RAM20_MEM_RULE0_RULE2_MASK)

#define SECTRL_RAM20_MEM_RULE0_RULE3_MASK        (0x3000U)
#define SECTRL_RAM20_MEM_RULE0_RULE3_SHIFT       (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM20_MEM_RULE0_RULE3(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM20_MEM_RULE0_RULE3_SHIFT)) & SECTRL_RAM20_MEM_RULE0_RULE3_MASK)
/*! @} */

/*! @name RAM30_MEM_RULE0 - SRAM Partition 0 Memory Rule */
/*! @{ */

#define SECTRL_RAM30_MEM_RULE0_RULE0_MASK        (0x3U)
#define SECTRL_RAM30_MEM_RULE0_RULE0_SHIFT       (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM30_MEM_RULE0_RULE0(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM30_MEM_RULE0_RULE0_SHIFT)) & SECTRL_RAM30_MEM_RULE0_RULE0_MASK)

#define SECTRL_RAM30_MEM_RULE0_RULE1_MASK        (0x30U)
#define SECTRL_RAM30_MEM_RULE0_RULE1_SHIFT       (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM30_MEM_RULE0_RULE1(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM30_MEM_RULE0_RULE1_SHIFT)) & SECTRL_RAM30_MEM_RULE0_RULE1_MASK)

#define SECTRL_RAM30_MEM_RULE0_RULE2_MASK        (0x300U)
#define SECTRL_RAM30_MEM_RULE0_RULE2_SHIFT       (8U)
/*! RULE2 - Rule 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM30_MEM_RULE0_RULE2(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM30_MEM_RULE0_RULE2_SHIFT)) & SECTRL_RAM30_MEM_RULE0_RULE2_MASK)

#define SECTRL_RAM30_MEM_RULE0_RULE3_MASK        (0x3000U)
#define SECTRL_RAM30_MEM_RULE0_RULE3_SHIFT       (12U)
/*! RULE3 - Rule 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define SECTRL_RAM30_MEM_RULE0_RULE3(x)          (((uint32_t)(((uint32_t)(x)) << SECTRL_RAM30_MEM_RULE0_RULE3_SHIFT)) & SECTRL_RAM30_MEM_RULE0_RULE3_MASK)
/*! @} */

